<script>
  import { slide } from "svelte/transition";
  let isOpen = false;
  const toggle = () => (isOpen = !isOpen);
</script>

<button on:click={toggle} aria-expanded={isOpen}>ルールを開く/閉じる</button>
{#if isOpen}
  <div transition:slide={{ duration: 1000 }}>
    <h2>ルール</h2>
    <p>
      このゲームはバトルロイヤルです。負けたプレイヤーは負け内容に応じて、宇宙生絞り牛乳を飲まされます。宇宙生絞り牛乳は過剰に摂取すると体が成長しすぎて、本人が宇宙そのものになってしまいます。自分が飲まされる前にほかの人に飲ませて宇宙にしてやりましょう。
    </p>

    <p>
      このゲームは大富豪やUNOのような、今までのプレイヤーが出したカードに対して、特定のカードを出していくカードゲームです。このようなゲームはトリックテイキングというジャンル名で呼ばれます。
    </p>

    <h3>基本の流れ</h3>

    <p>適当に最初のプレイヤーを決めます。</p>
    <p>
      1人1枚ずつカードを自分の前に出していきます。
      この自分の前に置いたカードのことを「場札」と呼びます。
    </p>
    <p>最初のプレイヤーは好きなカードを出せます。</p>
    <p>二人目からは出せるカードは2種類に限られます。</p>
    <li>
      <ol>
        全ての場札の中で1番大きな数字と同じ数字か、それよりも大きい数字のカード
      </ol>
      <ol>手札の中で1番小さな数字のカード</ol>
    </li>

    <p>
      全員が1枚ずつカードを出したら、場札のうち一番大きな数字のカードを一番最初に出したプレイヤーの名前を控えておきます。
    </p>
    <p>プレイヤーの名前を控えたら、場札を全て捨てます。</p>
    <p>
      ここまでの流れをこのあとも何回か繰り返していきます。ここまでの流れを「トリック」と呼称し、1回一通りやることを1トリック、3回やったら3トリックということにします。
    </p>
    <p>
      トリックが終わったら次のトリックへ移ります。次のトリックの最初のプレイヤーは「先のトリックの最後に控えたプレイヤーの次のプレイヤー」です。
    </p>

    <p>
      手札は7枚しかないので7トリックしたら0枚になります。なので7番目のトリックが最後のトリックです。特別なトリックなので最後の処理がちょっと変わります。
    </p>
    <p>
      最後に場札として数字が一番大きいカードを最初に出した人の名前を控えていたと思いますが、このプレイヤーは敗者となり、宇宙生絞り牛乳を飲まされます。飲まされる量は最後のトリックの場札に書かれている宇宙生絞り牛乳の数だけ飲むことになります。書かれていないカードがありますが、そのカードは0本ということではなく、全体の合計を倍にします。
    </p>
    <p>
      ここまでの7トリックを1ラウンドとし、ラウンドを繰り返していずれかのプレイヤー
    </p>

    <p>次のトリックの開始プレイヤーは</p>

    二人目からは、場に出ているカードの中で1番大きい数字のカードと同じ数字かそれよりも大きい数字のカードを出してください。
    もし出せないか、出したくない場合は手札の中で1番小さい数字のカードを出してください。
    つまり、毎回必ず1枚のカードを場に出すことになります。
    全員が1枚ずつカードを出したら、出ているカードを元に次の開始プレイヤーを決めます。
    1番大きい数字のカードを最初に出したプレイヤーが次の開始プレイヤーです。
    開始プレイヤーが決まったら場札を捨てます。 1. 全員がカードを1枚ずつだして 2.
    次の開始プレイヤーを決める これを繰り返していきます。
    この流れを1回やることを「1トリック」と呼んでいきます。
    場札を全て捨てて、次の開始プレイヤーからまたカードを順番に出していきます。
    手札は7枚なので、これを7トリック実施すると手札が0になります。
    7トリック目は開始プレイヤーを決めるのではなく、負けるプレイヤーを決めます。
    一番大きなカードを出したプレイヤーが負けです。 負けたプレイヤーは、
  </div>
{/if}

<style>
  button {
    border: none;
    background: none;
    display: block;
    color: inherit;
    font-size: 36px;
    cursor: pointer;
    margin: 0;
    padding-bottom: 0.5em;
    padding-top: 0.5em;
  }
</style>
